In [1]:
import numpy as np 
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt 
%matplotlib inline
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
import math

In [2]:
gold_sales = pd.read_csv('gold sales.csv')
demo = pd.read_csv('segmented_id.csv')
df = pd.merge(gold_sales , demo , on = 'ID' )
df.head()

,ID,gold_pur,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Year_Birth,Education,Marital_Status,income,Kidhome,Teenhome,segment
0,1826,218,NaN,NaN,NaN,NaN,NaN,NaN,1970,Graduation,Divorced,84835,0,0,1
1,1,37,NaN,NaN,NaN,NaN,NaN,NaN,1961,Graduation,Single,57091,0,0,1
2,10476,30,NaN,NaN,NaN,NaN,NaN,NaN,1958,Graduation,Married,67267,0,1,2
3,1386,0,NaN,NaN,NaN,NaN,NaN,NaN,1967,Graduation,Together,32474,1,1,3
4,5371,34,NaN,NaN,NaN,NaN,NaN,NaN,1989,Graduation,Single,21474,1,0,0

In [3]:
df.shape

(2216, 15)

In [4]:
df = df.drop(df.columns[[0,2,3,4,5,6,7]] , axis =1 )
df.head()

,gold_pur,Year_Birth,Education,Marital_Status,income,Kidhome,Teenhome,segment
0,218,1970,Graduation,Divorced,84835,0,0,1
1,37,1961,Graduation,Single,57091,0,0,1
2,30,1958,Graduation,Married,67267,0,1,2
3,0,1967,Graduation,Together,32474,1,1,3
4,34,1989,Graduation,Single,21474,1,0,0

In [5]:
#encoding Marital_Status and Education
code = {}
cols = ['Marital_Status' , 'Education']
for col in cols:
    code[col] = LabelEncoder().fit(df[col])
    
for col in cols :
    df[col] = code[col].transform(df[col])

In [6]:
independent = df.drop(df.columns[[0]] , axis =1 )
independent.head()

   Year_Birth  Education  Marital_Status  income  Kidhome  Teenhome  segment
0        1970          2               2   84835        0         0        1
1        1961          2               4   57091        0         0        1
2        1958          2               3   67267        0         1        2
3        1967          2               5   32474        1         1        3
4        1989          2               4   21474        1         0        0

In [7]:
dependent = df['gold_pur']
dependent.head()

0    218
1     37
2     30
3      0
4     34
Name: gold_pur, dtype: int64

# train test split

In [8]:
xtrain , xtest , ytrain , ytest = train_test_split(independent , dependent , test_size = 0.3)

In [9]:
xtrain , xtest , ytrain , ytest

(      Year_Birth  Education  Marital_Status  income  Kidhome  Teenhome  \
 156         1972          3               4   46423        1         1
 2023        1984          2               3   23228        1         0
 782         1978          3               5   61346        1         0
 35          1987          4               4   95169        0         0
 843         1978          2               3   51267        1         1
 ...          ...        ...             ...     ...      ...       ...
 2049        1971          2               4   31632        0         0
 287         1956          3               4   86424        0         0
 1162        1984          2               5   15345        1         0
 2095        1974          2               5   47889        1         0
 363         1986          3               4   21888        1         0

       segment
 156         3
 2023        0
 782         0
 35          1
 843         3
 ...       ...
 2049        0
 287         1
 1162        0
 2095        0
 363         0

 [1551 rows x 7 columns],
       Year_Birth  Education  Marital_Status  income  Kidhome  Teenhome  \
 45          1961          2               5   64260        0         0
 410         1957          0               3   53233        0         1
 33          1974          4               3   46374        0         1
 392         1972          4               5   38887        1         0
 1868        1962          2               5   75072        0         1
 ...          ...        ...             ...     ...      ...       ...
 639         1972          2               3   30023        1         0
 1156        1989          2               3   37155        1         0
 1837        1959          2               2   63033        0         0
 1670        1953          2               3   75027        0         1
 174         1978          3               4   68092        0         0

       segment
 45          4
 410         2
 33          2
 392         0
 1868        4
 ...       ...
 639         0
 1156        0
 1837        1
 1670        2
 174         1

 [665 rows x 7 columns],
 156       8
 2023      5
 782     142
 35       20
 843      12
        ...
 2049     32
 287      68
 1162     19
 2095      4
 363      64
 Name: gold_pur, Length: 1551, dtype: int64,
 45       30
 410       0
 33       17
 392       3
 1868    125
        ...
 639      21
 1156      3
 1837     30
 1670     77
 174      48
 Name: gold_pur, Length: 665, dtype: int64)

In [10]:
model = LinearRegression()
model.fit(xtrain , ytrain)
model.coef_ , model.intercept_

(array([ 2.41660499e-01, -7.00661523e+00, -1.60141953e+00,  7.53311317e-04,
        -1.98084417e+01, -3.93901354e+00,  1.66311357e+00]),
 -440.5793727591762)

In [11]:
ypred = model.predict(xtest)

In [12]:
mse = mean_squared_error(ytest,ypred)
mse

2486.579108030804

In [13]:
rmse = math.sqrt(mse)
rmse

49.865610474863374

In [14]:
np.mean(df['gold_pur'])

43.96525270758123